Model: "model"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
Input (InputLayer)           [(None, 256, 256, 3)]     0         
_________________________________________________________________
REF_0 (ReflectionPadding2D)  (None, 262, 262, 3)       0         
_________________________________________________________________
c7s1-64 (Sequential)         (None, 256, 256, 64)      9536      
_________________________________________________________________
d128 (Sequential)            (None, 128, 128, 128)     73984     
_________________________________________________________________
d256 (Sequential)            (None, 64, 64, 256)       295424    
_________________________________________________________________
max_pooling2d (MaxPooling2D) (None, 32, 32, 256)       0         
_________________________________________________________________
d512 (Sequential)            (None, 16, 16, 512)       1180672   
_________________________________________________________________
global_average_pooling2d (Gl (None, 512)               0         
_________________________________________________________________
dense (Dense)                (None, 1)                 513       
=================================================================
Total params: 1,560,129
Trainable params: 1,560,129
Non-trainable params: 0
_________________________________________________________________
